app/controllers/comments_controller.rb

  def create
    # binding.break
    @micropost = Micropost.find(params[:micropost_id])
    @comment = @micropost.comments.new(comment_params)

    respond_to do |format|
      if @comment.save
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 301], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "micropost_id", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "123"], ["micropost_id", 301], ["parent_id", nil], ["created_at", "2022-04-01 08:31:19.344532"], ["updated_at", "2022-04-01 08:31:19.344532"]]