app/controllers/microposts_controller.rb

    def show
        @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 217], ["LIMIT", 1]]