app/models/user.rb

    def follow(other_user)
        active_relationships.create(followed_id: other_user.id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 3], ["created_at", "2022-04-04 08:56:21.853050"], ["updated_at", "2022-04-04 08:56:21.853050"]]

    def unfollow(other_user)
        active_relationships.find_by(followed_id: other_user.id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 90]]